Белгипрозем_2017/src/Documents/мВнесениеДатыРешения/мВнесениеДатыРешения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мВнесениеДатыРешения</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРешения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сроки</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Documents/мВнесениеДатыРешения/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мВнесениеДатыРешенияСроки.Ссылка.Дата КАК Дата,
		|	мВнесениеДатыРешенияСроки.Ссылка.ДатаРешения КАК ДатаРешения,
		|	мВнесениеДатыРешенияСроки.Договор,
		|	мВнесениеДатыРешенияСроки.ЭтапДоговора,
		|	мВнесениеДатыРешенияСроки.Ссылка.Ответственный КАК Ответственный,
		|	мВнесениеДатыРешенияСроки.ЭтапДоговора.ЗапретИзмененияПлановогоСрока КАК ЗапретИзмененияПлановогоСрока
		|ИЗ
		|	Документ.мВнесениеДатыРешения.Сроки КАК мВнесениеДатыРешенияСроки
		|ГДЕ
		|	мВнесениеДатыРешенияСроки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.Выполнить();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаСроки", Результат.Выгрузить());
	
КонецПроцедуры
